Revit 2027 API
IFCLinkDocumentExportScope Constructor
 Instantiates a default IFCLinkDocumentExportScope object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCLinkDocumentExportScope(
	Document pADoc
)
Public Sub New (
	pADoc As Document
)
public:
IFCLinkDocumentExportScope(
	Document^ pADoc
)
new :
        pADoc : Document -> IFCLinkDocumentExportScope
Parameters
pADoc Document
 The linked document to export.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCLinkDocumentExportScope Class
Autodesk.Revit.DB.IFC Namespace